---
kind: property
id: P:Autodesk.Revit.DB.FilledRegionType.BackgroundPatternColor
source: html/3300fa4e-2a5d-0366-6a89-42b55a4383fc.htm
---
# Autodesk.Revit.DB.FilledRegionType.BackgroundPatternColor Property

The background fill pattern color.

## Syntax (C#)
```csharp
public Color BackgroundPatternColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null